<?php

//Заголовок

$MESS['TITLE_PAGE'] = 'Чек-лист запуска сайта';

//Основные чекбоксы

$MESS['CHECK_1'] = 'Контент';
$MESS['CHECK_2'] = 'Валидация';
$MESS['CHECK_3'] = 'Тестирование функциональности';
$MESS['CHECK_4'] = 'Безопастность/Риски';
$MESS['CHECK_5'] = 'Производительность';

//Дополнительная информация

$MESS['DOP_INFO_1'] = 'Контент сайта – это любая информация, размещенная на нем. Чаще всего под контентом понимают текстовое наполнение, реже – видео- и аудиоматериалы.';
$MESS['DOP_INFO_2'] = 'Валидация сайта — это проверка синтаксических ошибок, проверка HTML.';
$MESS['DOP_INFO_3'] = 'Проверка работы отдельных модулей и компонентов сайта.';
$MESS['DOP_INFO_4'] = 'Аудит безопасности сайта (проверка сайта на уязвимости) — ряд процедур, нацеленных на обеспечение стабильной работы веб-ресурса, безопасности данных и снижения рисков.';
$MESS['DOP_INFO_5'] = 'Проверка скорости работы сайта под нагрузкой.';

// Дополнительные чекбоксы

//CHECK_1

$MESS['CHECK_1_1'] = 'Вычитать тексты и проверить правописание';
$MESS['CHECK_1_2'] = 'Проверить не осталось ли на сайте тестового контента';
$MESS['CHECK_1_3'] = 'При редизайне или изменении информационной архитектуры, проверить стоят ли редиректы со старых адресов разделов на новые';
$MESS['CHECK_1_4'] = 'Проверить скрытые текст (e.g. alt/title атрибуты HTML тегов, тексты в JavaScript функциях)';

//CHECK_2

$MESS['CHECK_2_1'] = 'JavaScript валидация';
$MESS['CHECK_2_2'] = 'CSS валидация';
$MESS['CHECK_2_3'] = 'HTML валидация';

//CHECK_3

$MESS['CHECK_3_1'] = 'Проверить весь заказанный/особый/сложный функционал';
$MESS['CHECK_3_2'] = 'Проверить работу поиска (включая релевантность)';
$MESS['CHECK_3_3'] = 'Проверить работу сайта в разных браузерах (Internet Explorer, Firefox, Opera, Safari, Chrome etc.), версиях (6, 7, 2.2, 3.1 etc.) и платформах (Windows, OSX, Linux)';
$MESS['CHECK_3_4'] = 'Проверить вид сайта на разных разрешениях экрана (1280×1024, 1024×768, 1920×1200, 800×600...)';
$MESS['CHECK_3_5'] = 'Протестировать все формы (контактов, комментариев, фидбека, ...), поставить на них капчу или другую защиту';

//CHECK_4

$MESS['CHECK_4_1'] = 'Настроить бекапы по расписанию, и проверить восстановление из них';
$MESS['CHECK_4_2'] = 'Проверить нет ли у посетителей доступа к служебным/секретным/закрытым страницам';
$MESS['CHECK_4_3'] = 'Закрыть поисковикам доступ к служебным/секретным/закрытым разделам сайта, используя robots.txt';
$MESS['CHECK_4_4'] = 'Отключить вывод ошибок на экран';
$MESS['CHECK_4_5'] = 'Настроить email/SMS уведомления о неработоспособности сайта/сервера';

//CHECK_5

$MESS['CHECK_5_1'] = 'Провести нагрузочное тестирование';
$MESS['CHECK_5_2'] = 'Проверить и реализовать кэширование где это необходимо';
$MESS['CHECK_5_3'] = 'Проверить общий размер/скорость загрузки страниц сайта';
$MESS['CHECK_5_4'] = 'Минимизировать/сжать статику (JavaScript/HTML/CSS)';
$MESS['CHECK_5_5'] = 'Оптимизировать CSS: короткие пути к изображениям, использовать «каскадную» природу стилей, и т.д.';
$MESS['CHECK_5_6'] = 'Проверить наличие индексов в таблицах БД';