<?php

//Заголовки

$MESS['TITLE_PAGE'] = 'Главная';
$MESS['TITLE_TEHN_PAGE'] = 'Чек-лист технического аудита сайта';
$MESS['TITLE_START_PAGE'] = 'Чек-лист запуска сайта';

//Дополнительная информация

$MESS['CHECK_START_INFO'] = 'С помощью этого чек-листа проверяют сайты перед запуском. Благодаря ему сайт легко стартует, к нему выше доверие поисковых систем и посетителей.';
$MESS['CHECK_TEHN_INFO'] = 'это целый комплекс проверок и тестов сайта для выявления и своевременного решения проблем, способных негативно повлиять на продвижение в поиске. Главная цель аудита — детальное изучение особенностей работы системы «Веб-сервер — движок сайта — контент», поиск ошибок и предоставление рекомендаций по их устранению.';
